====================
Simple Math Operator
====================

4 + 5

---

(program
  (expression_statement
    (addition
      (integer_literal
        (decimal_int))
      (integer_literal
        (decimal_int)))))

======================
Test Simple Precedence
======================

4 + 5 * 2

---

(program
  (expression_statement
    (addition
      (integer_literal
        (decimal_int))
      (multiplication
        (integer_literal
          (decimal_int))
        (integer_literal
          (decimal_int))))))

=====================
Test Group Precedence
=====================

(4 + 5) * 2

---

(program
  (expression_statement
  (multiplication
    (group
      (addition
        (integer_literal
          (decimal_int))
        (integer_literal
          (decimal_int))))
    (integer_literal
      (decimal_int)))))

===================================
Test Group Precedence with Negation
===================================

-(4 + 5) * 2

---

(program
  (expression_statement
    (multiplication
      (negation
        (group
          (addition
            (integer_literal
              (decimal_int))
            (integer_literal
              (decimal_int)))))
      (integer_literal
        (decimal_int)))))