======================================
Basic Type without constraints (alias)
======================================

type Turn = float

---

(program
  (type_declaration
    (constrained_type
      (constrained_type_name)
      (float_type))))

=======================
Type with literal union
=======================

type CSSColorName = "red" | "green" | "blue" | "rebeccapurple" | "aliceblue"
type Status = 200 | 404 | 500

---

(program
  (type_declaration
    (constrained_type
      (constrained_type_name)
      (literal_union
        (literal_val
          (string_literal
            (string_content)))
        (literal_val
          (string_literal
            (string_content)))
        (literal_val
          (string_literal
            (string_content)))
        (literal_val
          (string_literal
            (string_content)))
        (literal_val
          (string_literal
            (string_content))))))
  (type_declaration
    (constrained_type
      (constrained_type_name)
      (literal_union
        (literal_val
          (integer_literal
            (decimal_int)))
        (literal_val
          (integer_literal
            (decimal_int)))
        (literal_val
          (integer_literal
            (decimal_int)))))))

=================================
Type with range constraints
=================================

type Angle = float where range(0..<360), precision(6, round_up)
type Radian = f64 where range(0..=2*PI), precision(2, round_trunc)
type Alpha = f32 where range(0..=1)

---

(program
  (type_declaration
    (constrained_type
      (constrained_type_name)
      (float_type)
      (constraints
        (range_constraint
          (constraint_math_expr
            (integer_literal
              (decimal_int)))
          (less_than_comparator)
          (constraint_math_expr
            (integer_literal
              (decimal_int))))
        (precision_constraint
          (constraint_math_expr
            (integer_literal
              (decimal_int)))
          (rounding_mode
            (up_rounding_mode))))))
  (type_declaration
    (constrained_type
      (constrained_type_name)
      (float_type)
      (constraints
        (range_constraint
          (constraint_math_expr
            (integer_literal
              (decimal_int)))
          (equal_to_comparator)
          (constraint_math_expr
            (constraint_multiplication
              (constraint_math_expr
                (integer_literal
                  (decimal_int)))
              (constraint_math_expr
                (const_identifier)))))
        (precision_constraint
          (constraint_math_expr
            (integer_literal
              (decimal_int)))
          (rounding_mode
            (truncate_rounding_mode))))))
  (type_declaration
    (constrained_type
      (constrained_type_name)
      (float_type)
      (constraints
        (range_constraint
          (constraint_math_expr
            (integer_literal
              (decimal_int)))
          (equal_to_comparator)
          (constraint_math_expr
            (integer_literal
              (decimal_int))))))))

==================================
Type with pattern constraint
==================================

type HexStr = string where pattern(r/^#(?:[0-9a-fA-F]{3}){1,2}$/)

---

(program
  (type_declaration
    (constrained_type
      (constrained_type_name)
      (string_type)
      (constraints
        (pattern_constraint
          (regex_literal))))))

=========================
Type with step constraint
=========================

// Only multiples of 0.25 (for currency with quarter precision)
type Quarter = float where range(0..=100), step(0.25)
// Valid: 0, 0.25, 0.5, 0.75, 1.0, 1.25, ...

// Degrees in 15Â° increments
type CompassHeading = int where range(0..<360), step(15)
// Valid: 0, 15, 30, 45, ..., 345

---

(program
  (comment)
  (type_declaration
    (constrained_type
      (constrained_type_name)
      (float_type)
      (constraints
        (range_constraint
          (constraint_math_expr
            (integer_literal
              (decimal_int)))
          (equal_to_comparator)
          (constraint_math_expr
            (integer_literal
              (decimal_int))))
        (step_constraint
          (constraint_math_expr
            (float_literal))))))
  (comment)
  (comment)
  (type_declaration
    (constrained_type
      (constrained_type_name)
      (signed_integer_type)
      (constraints
        (range_constraint
          (constraint_math_expr
            (integer_literal
              (decimal_int)))
          (less_than_comparator)
          (constraint_math_expr
            (integer_literal
              (decimal_int))))
        (step_constraint
          (constraint_math_expr
            (integer_literal
              (decimal_int)))))))
  (comment))

===================================
Type without right side is an error
===================================

type Foo =

---

(program
  (type_declaration
    (constrained_type
      (constrained_type_name)
      (literal_union
        (literal_val
          (integer_literal
            (decimal_int
              (MISSING "decimal_int_token1"))))))))      