===============
Equals operator
===============

x == 42

---

(program
  (expression_statement
    (boolean_expr
      (identifier)
      (equals_operator)
      (integer_literal
        (decimal_int)))))

===================
Not Equals operator
===================

x != 42

---

(program
  (expression_statement
    (boolean_expr
      (identifier)
      (not_equals_operator)
      (integer_literal
        (decimal_int)))))

==================
Less-than operator
==================

x < 42

---

(program
  (expression_statement
    (boolean_expr
      (identifier)
      (less_than_operator)
      (integer_literal
        (decimal_int)))))

=====================
Greater-than operator
=====================

x > 42

---

(program
  (expression_statement
    (boolean_expr
      (identifier)
      (greater_than_operator)
      (integer_literal
        (decimal_int)))))

===========================
Less-than or equal operator
===========================

x <= 42

---

(program
  (expression_statement
    (boolean_expr
      (identifier)
      (less_than_or_equal_operator)
      (integer_literal
        (decimal_int)))))

==============================
Greater-than or equal operator
==============================

x >= 42

---

(program
  (expression_statement
    (boolean_expr
      (identifier)
      (greater_than_or_equal_operator)
      (integer_literal
        (decimal_int)))))

============
And operator
============

0 <= x && x <= 10

---

(program
  (expression_statement
    (boolean_expr
      (boolean_expr
        (integer_literal
          (decimal_int))
        (less_than_or_equal_operator)
        (identifier))
      (and)
      (boolean_expr
        (identifier)
        (less_than_or_equal_operator)
        (integer_literal
          (decimal_int))))))

===========
Or operator
===========

x == 0 || x == 42

---

(program
  (expression_statement
    (boolean_expr
      (boolean_expr
        (identifier)
        (equals_operator)
        (integer_literal
          (decimal_int)))
      (or)
      (boolean_expr
        (identifier)
        (equals_operator)
        (integer_literal
          (decimal_int))))))

============================
Not Operator with identifier
============================

!x

---

(program
  (expression_statement
    (boolean_expr
      (not)
      (identifier))))

==========================================
Not Operator with parenthesized expression
==========================================

!(x == 42)

---

(program
  (expression_statement
    (boolean_expr
      (not)
      (parenthesized_expression
        (boolean_expr
          (identifier)
          (equals_operator)
          (integer_literal
            (decimal_int)))))))

============================================
Comparison without right operand is an error
:error
============================================

x ==

---

(program
  (identifier)
  (ERROR
    (equality_operator)))

==============================================
Double negation without expression is an error
:error
==============================================

!!

---


(program
  (boolean_expr
    (not)
    (boolean_expr
      (not)
      (integer
        (MISSING _digit_sequence)))))

==============================================
And operator without right operand is an error
:error
==============================================

x && 

---

(program
  (identifier)
  (ERROR
    (and)))   